-- phpMyAdmin SQL Dump
-- version 4.9.0.1
-- https://www.phpmyadmin.net/
--
-- 主机： 127.0.0.1
-- 生成日期： 2019-09-27 13:40:31
-- 服务器版本： 10.3.16-MariaDB
-- PHP 版本： 7.1.30

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 数据库： `footprint`
--

-- --------------------------------------------------------

--
-- 表的结构 `city`
--

CREATE TABLE `city` (
  `cid` int(11) NOT NULL DEFAULT 0,
  `pid` int(11) DEFAULT NULL,
  `cityname` varchar(255) CHARACTER SET utf8 DEFAULT NULL,
  `type` int(11) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- 转存表中的数据 `city`
--

INSERT INTO `city` (`cid`, `pid`, `cityname`, `type`) VALUES
(1, 0, '中国', 0),
(2, 1, '北京', 1),
(3, 1, '安徽', 1),
(4, 1, '福建', 1),
(5, 1, '甘肃', 1),
(6, 1, '广东', 1),
(7, 1, '广西', 1),
(8, 1, '贵州', 1),
(9, 1, '海南', 1),
(10, 1, '河北', 1),
(11, 1, '河南', 1),
(12, 1, '黑龙江', 1),
(13, 1, '湖北', 1),
(14, 1, '湖南', 1),
(15, 1, '吉林', 1),
(16, 1, '江苏', 1),
(17, 1, '江西', 1),
(18, 1, '辽宁', 1),
(19, 1, '内蒙古', 1),
(20, 1, '宁夏', 1),
(21, 1, '青海', 1),
(22, 1, '山东', 1),
(23, 1, '山西', 1),
(24, 1, '陕西', 1),
(25, 1, '上海', 1),
(26, 1, '四川', 1),
(27, 1, '天津', 1),
(28, 1, '西藏', 1),
(29, 1, '新疆', 1),
(30, 1, '云南', 1),
(31, 1, '浙江', 1),
(32, 1, '重庆', 1),
(33, 1, '香港', 1),
(34, 1, '澳门', 1),
(35, 1, '台湾', 1),
(36, 3, '安庆', 2),
(37, 3, '蚌埠', 2),
(38, 3, '巢湖', 2),
(39, 3, '池州', 2),
(40, 3, '滁州', 2),
(41, 3, '阜阳', 2),
(42, 3, '淮北', 2),
(43, 3, '淮南', 2),
(44, 3, '黄山', 2),
(45, 3, '六安', 2),
(46, 3, '马鞍山', 2),
(47, 3, '宿州', 2),
(48, 3, '铜陵', 2),
(49, 3, '芜湖', 2),
(50, 3, '宣城', 2),
(51, 3, '亳州', 2),
(52, 2, '市辖区', 2),
(53, 4, '福州', 2),
(54, 4, '龙岩', 2),
(55, 4, '南平', 2),
(56, 4, '宁德', 2),
(57, 4, '莆田', 2),
(58, 4, '泉州', 2),
(59, 4, '三明', 2),
(60, 4, '厦门', 2),
(61, 4, '漳州', 2),
(62, 5, '兰州', 2),
(63, 5, '白银', 2),
(64, 5, '定西', 2),
(65, 5, '甘南', 2),
(66, 5, '嘉峪关', 2),
(67, 5, '金昌', 2),
(68, 5, '酒泉', 2),
(69, 5, '临夏', 2),
(70, 5, '陇南', 2),
(71, 5, '平凉', 2),
(72, 5, '庆阳', 2),
(73, 5, '天水', 2),
(74, 5, '武威', 2),
(75, 5, '张掖', 2),
(76, 6, '广州', 2),
(77, 6, '深圳', 2),
(78, 6, '潮州', 2),
(79, 6, '东莞', 2),
(80, 6, '佛山', 2),
(81, 6, '河源', 2),
(82, 6, '惠州', 2),
(83, 6, '江门', 2),
(84, 6, '揭阳', 2),
(85, 6, '茂名', 2),
(86, 6, '梅州', 2),
(87, 6, '清远', 2),
(88, 6, '汕头', 2),
(89, 6, '汕尾', 2),
(90, 6, '韶关', 2),
(91, 6, '阳江', 2),
(92, 6, '云浮', 2),
(93, 6, '湛江', 2),
(94, 6, '肇庆', 2),
(95, 6, '中山', 2),
(96, 6, '珠海', 2),
(97, 7, '南宁', 2),
(98, 7, '桂林', 2),
(99, 7, '百色', 2),
(100, 7, '北海', 2),
(101, 7, '崇左', 2),
(102, 7, '防城港', 2),
(103, 7, '贵港', 2),
(104, 7, '河池', 2),
(105, 7, '贺州', 2),
(106, 7, '来宾', 2),
(107, 7, '柳州', 2),
(108, 7, '钦州', 2),
(109, 7, '梧州', 2),
(110, 7, '玉林', 2),
(111, 8, '贵阳', 2),
(112, 8, '安顺', 2),
(113, 8, '毕节', 2),
(114, 8, '六盘水', 2),
(115, 8, '黔东南', 2),
(116, 8, '黔南', 2),
(117, 8, '黔西南', 2),
(118, 8, '铜仁', 2),
(119, 8, '遵义', 2),
(120, 9, '海口', 2),
(121, 9, '三亚', 2),
(122, 9, '白沙', 2),
(123, 9, '保亭', 2),
(124, 9, '昌江', 2),
(125, 9, '澄迈县', 2),
(126, 9, '定安县', 2),
(127, 9, '东方', 2),
(128, 9, '乐东', 2),
(129, 9, '临高县', 2),
(130, 9, '陵水', 2),
(131, 9, '琼海', 2),
(132, 9, '琼中', 2),
(133, 9, '屯昌县', 2),
(134, 9, '万宁', 2),
(135, 9, '文昌', 2),
(136, 9, '五指山', 2),
(137, 9, '儋州', 2),
(138, 10, '石家庄', 2),
(139, 10, '保定', 2),
(140, 10, '沧州', 2),
(141, 10, '承德', 2),
(142, 10, '邯郸', 2),
(143, 10, '衡水', 2),
(144, 10, '廊坊', 2),
(145, 10, '秦皇岛', 2),
(146, 10, '唐山', 2),
(147, 10, '邢台', 2),
(148, 10, '张家口', 2),
(149, 11, '郑州', 2),
(150, 11, '洛阳', 2),
(151, 11, '开封', 2),
(152, 11, '安阳', 2),
(153, 11, '鹤壁', 2),
(154, 11, '济源', 2),
(155, 11, '焦作', 2),
(156, 11, '南阳', 2),
(157, 11, '平顶山', 2),
(158, 11, '三门峡', 2),
(159, 11, '商丘', 2),
(160, 11, '新乡', 2),
(161, 11, '信阳', 2),
(162, 11, '许昌', 2),
(163, 11, '周口', 2),
(164, 11, '驻马店', 2),
(165, 11, '漯河', 2),
(166, 11, '濮阳', 2),
(167, 12, '哈尔滨', 2),
(168, 12, '大庆', 2),
(169, 12, '大兴安岭', 2),
(170, 12, '鹤岗', 2),
(171, 12, '黑河', 2),
(172, 12, '鸡西', 2),
(173, 12, '佳木斯', 2),
(174, 12, '牡丹江', 2),
(175, 12, '七台河', 2),
(176, 12, '齐齐哈尔', 2),
(177, 12, '双鸭山', 2),
(178, 12, '绥化', 2),
(179, 12, '伊春', 2),
(180, 13, '武汉', 2),
(181, 13, '仙桃', 2),
(182, 13, '鄂州', 2),
(183, 13, '黄冈', 2),
(184, 13, '黄石', 2),
(185, 13, '荆门', 2),
(186, 13, '荆州', 2),
(187, 13, '潜江', 2),
(188, 13, '神农架林区', 2),
(189, 13, '十堰', 2),
(190, 13, '随州', 2),
(191, 13, '天门', 2),
(192, 13, '咸宁', 2),
(193, 13, '襄樊', 2),
(194, 13, '孝感', 2),
(195, 13, '宜昌', 2),
(196, 13, '恩施', 2),
(197, 14, '长沙', 2),
(198, 14, '张家界', 2),
(199, 14, '常德', 2),
(200, 14, '郴州', 2),
(201, 14, '衡阳', 2),
(202, 14, '怀化', 2),
(203, 14, '娄底', 2),
(204, 14, '邵阳', 2),
(205, 14, '湘潭', 2),
(206, 14, '湘西', 2),
(207, 14, '益阳', 2),
(208, 14, '永州', 2),
(209, 14, '岳阳', 2),
(210, 14, '株洲', 2),
(211, 15, '长春', 2),
(212, 15, '吉林', 2),
(213, 15, '白城', 2),
(214, 15, '白山', 2),
(215, 15, '辽源', 2),
(216, 15, '四平', 2),
(217, 15, '松原', 2),
(218, 15, '通化', 2),
(219, 15, '延边', 2),
(220, 16, '南京', 2),
(221, 16, '苏州', 2),
(222, 16, '无锡', 2),
(223, 16, '常州', 2),
(224, 16, '淮安', 2),
(225, 16, '连云港', 2),
(226, 16, '南通', 2),
(227, 16, '宿迁', 2),
(228, 16, '泰州', 2),
(229, 16, '徐州', 2),
(230, 16, '盐城', 2),
(231, 16, '扬州', 2),
(232, 16, '镇江', 2),
(233, 17, '南昌', 2),
(234, 17, '抚州', 2),
(235, 17, '赣州', 2),
(236, 17, '吉安', 2),
(237, 17, '景德镇', 2),
(238, 17, '九江', 2),
(239, 17, '萍乡', 2),
(240, 17, '上饶', 2),
(241, 17, '新余', 2),
(242, 17, '宜春', 2),
(243, 17, '鹰潭', 2),
(244, 18, '沈阳', 2),
(245, 18, '大连', 2),
(246, 18, '鞍山', 2),
(247, 18, '本溪', 2),
(248, 18, '朝阳', 2),
(249, 18, '丹东', 2),
(250, 18, '抚顺', 2),
(251, 18, '阜新', 2),
(252, 18, '葫芦岛', 2),
(253, 18, '锦州', 2),
(254, 18, '辽阳', 2),
(255, 18, '盘锦', 2),
(256, 18, '铁岭', 2),
(257, 18, '营口', 2),
(258, 19, '呼和浩特', 2),
(259, 19, '阿拉善盟', 2),
(260, 19, '巴彦淖尔盟', 2),
(261, 19, '包头', 2),
(262, 19, '赤峰', 2),
(263, 19, '鄂尔多斯', 2),
(264, 19, '呼伦贝尔', 2),
(265, 19, '通辽', 2),
(266, 19, '乌海', 2),
(267, 19, '乌兰察布市', 2),
(268, 19, '锡林郭勒盟', 2),
(269, 19, '兴安盟', 2),
(270, 20, '银川', 2),
(271, 20, '固原', 2),
(272, 20, '石嘴山', 2),
(273, 20, '吴忠', 2),
(274, 20, '中卫', 2),
(275, 21, '西宁', 2),
(276, 21, '果洛', 2),
(277, 21, '海北', 2),
(278, 21, '海东', 2),
(279, 21, '海南', 2),
(280, 21, '海西', 2),
(281, 21, '黄南', 2),
(282, 21, '玉树', 2),
(283, 22, '济南', 2),
(284, 22, '青岛', 2),
(285, 22, '滨州', 2),
(286, 22, '德州', 2),
(287, 22, '东营', 2),
(288, 22, '菏泽', 2),
(289, 22, '济宁', 2),
(290, 22, '莱芜', 2),
(291, 22, '聊城', 2),
(292, 22, '临沂', 2),
(293, 22, '日照', 2),
(294, 22, '泰安', 2),
(295, 22, '威海', 2),
(296, 22, '潍坊', 2),
(297, 22, '烟台', 2),
(298, 22, '枣庄', 2),
(299, 22, '淄博', 2),
(300, 23, '太原', 2),
(301, 23, '长治', 2),
(302, 23, '大同', 2),
(303, 23, '晋城', 2),
(304, 23, '晋中', 2),
(305, 23, '临汾', 2),
(306, 23, '吕梁', 2),
(307, 23, '朔州', 2),
(308, 23, '忻州', 2),
(309, 23, '阳泉', 2),
(310, 23, '运城', 2),
(311, 24, '西安', 2),
(312, 24, '安康', 2),
(313, 24, '宝鸡', 2),
(314, 24, '汉中', 2),
(315, 24, '商洛', 2),
(316, 24, '铜川', 2),
(317, 24, '渭南', 2),
(318, 24, '咸阳', 2),
(319, 24, '延安', 2),
(320, 24, '榆林', 2),
(321, 25, '上海', 2),
(322, 26, '成都', 2),
(323, 26, '绵阳', 2),
(324, 26, '阿坝', 2),
(325, 26, '巴中', 2),
(326, 26, '达州', 2),
(327, 26, '德阳', 2),
(328, 26, '甘孜', 2),
(329, 26, '广安', 2),
(330, 26, '广元', 2),
(331, 26, '乐山', 2),
(332, 26, '凉山', 2),
(333, 26, '眉山', 2),
(334, 26, '南充', 2),
(335, 26, '内江', 2),
(336, 26, '攀枝花', 2),
(337, 26, '遂宁', 2),
(338, 26, '雅安', 2),
(339, 26, '宜宾', 2),
(340, 26, '资阳', 2),
(341, 26, '自贡', 2),
(342, 26, '泸州', 2),
(343, 27, '天津', 2),
(344, 28, '拉萨', 2),
(345, 28, '阿里', 2),
(346, 28, '昌都', 2),
(347, 28, '林芝', 2),
(348, 28, '那曲', 2),
(349, 28, '日喀则', 2),
(350, 28, '山南', 2),
(351, 29, '乌鲁木齐', 2),
(352, 29, '阿克苏', 2),
(353, 29, '阿拉尔', 2),
(354, 29, '巴音郭楞', 2),
(355, 29, '博尔塔拉', 2),
(356, 29, '昌吉', 2),
(357, 29, '哈密', 2),
(358, 29, '和田', 2),
(359, 29, '喀什', 2),
(360, 29, '克拉玛依', 2),
(361, 29, '克孜勒苏', 2),
(362, 29, '石河子', 2),
(363, 29, '图木舒克', 2),
(364, 29, '吐鲁番', 2),
(365, 29, '五家渠', 2),
(366, 29, '伊犁', 2),
(367, 30, '昆明', 2),
(368, 30, '怒江', 2),
(369, 30, '普洱', 2),
(370, 30, '丽江', 2),
(371, 30, '保山', 2),
(372, 30, '楚雄', 2),
(373, 30, '大理', 2),
(374, 30, '德宏', 2),
(375, 30, '迪庆', 2),
(376, 30, '红河', 2),
(377, 30, '临沧', 2),
(378, 30, '曲靖', 2),
(379, 30, '文山', 2),
(380, 30, '西双版纳', 2),
(381, 30, '玉溪', 2),
(382, 30, '昭通', 2),
(383, 31, '杭州', 2),
(384, 31, '湖州', 2),
(385, 31, '嘉兴', 2),
(386, 31, '金华', 2),
(387, 31, '丽水', 2),
(388, 31, '宁波', 2),
(389, 31, '绍兴', 2),
(390, 31, '台州', 2),
(391, 31, '温州', 2),
(392, 31, '舟山', 2),
(393, 31, '衢州', 2),
(394, 32, '重庆', 2),
(395, 33, '香港', 2),
(396, 34, '澳门', 2),
(397, 35, '台湾', 2);

-- --------------------------------------------------------

--
-- 表的结构 `footprint_70`
--

CREATE TABLE `footprint_70` (
  `chid` int(30) NOT NULL COMMENT '70周年足迹id',
  `chimg` char(200) NOT NULL COMMENT '70周年图片',
  `chdate` date NOT NULL COMMENT '70周年日期',
  `chtext` varchar(500) NOT NULL COMMENT '70周年事件'
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `footprint_70`
--

INSERT INTO `footprint_70` (`chid`, `chimg`, `chdate`, `chtext`) VALUES
(1, 'img/70/1949001.jpg', '1949-10-01', '1949年10月1日，毛泽东主席在北京天安门庄严宣告中华人民共和国成立'),
(2, 'img/70/1950002.jpeg', '1950-10-19', '1950年，中国人民解放军志愿军参加抗美援朝战争'),
(3, 'img/70/1964002.jpeg', '1964-10-16', '1964年10月16日，中国第一颗原子弹在罗布泊爆炸成功'),
(4, 'img/70/1967002.jpg', '1967-06-17', '1967年6月17日，中国第一颗氢弹在罗布泊爆炸成功'),
(5, 'img/70/1971001.jpg', '1971-10-25', '1971年10月25日，中华人民共和国恢复联合国席位'),
(6, 'img/70/1973001.jpg', '1973-10-01', '1973年，袁隆平在全世界首次培育出灿型杂交水稻。'),
(7, 'img/70/1970001.jpg', '1970-12-26', '1970年12月26日，中国第一艘核潜艇为091型攻击核潜艇“长征1号”下水，称为世界的第五个拥有核潜艇的国家；'),
(8, 'img/70/1984001.jpg', '1984-07-29', '1984年7月29日，中国射击选手许海峰在美国洛杉矶举行的第23届奥运会上获得金牌，成为我国第一个在奥运会上获得金牌的运动员'),
(9, 'img/70/1990001.jpg', '1990-09-22', '1990年9月22日至10月7日，第十一届亚洲运动会在北京举行'),
(10, 'img/70/1997001.jpeg', '1997-07-01', '1997年7月1日，香港回归，中华人民共和国香港特别行政区正式成立'),
(11, 'img/70/1999002.jpg', '1999-12-20', '1999年12月20日，澳门回归，中华人民共和国澳门特别行政区正式成立'),
(12, 'img/70/1999001.jpg', '1999-11-20', '1999年11月20日，中国第一艘无人试验飞船神舟一号飞船在酒泉起飞'),
(13, 'img/70/2001001.jpg', '2001-11-10', '2001年11月10日，中国正式加入WTO（世界贸易组织）'),
(14, 'img/70/2003001.jpg', '2003-03-04', '2003年，全国爆发“非典”疫情，全国各族人民参与“万众一心，抗击非典”，最终夺取抗击非典的胜利'),
(15, 'img/70/2003002.jpg', '2003-10-15', '2003年10月15日，中国首次载人航天飞船在中国酒泉卫星发射中心发射成功；'),
(16, 'img/70/2008001.png', '2008-05-12', '2008年5月12日，四川汶川发生里氏8.0级特大地震，在党中央，国务院的领导下，在人民解放军、武警部队和国际社会的支持下，抗震救灾取得成立，并且铸就了中国人民不屈的抗震救灾精神'),
(17, 'img/70/2008002.jpg', '2008-08-08', '2008年8月8日-24日，第二十九届全球奥林匹克运动会在首都北京成功举办'),
(18, 'img/70/2011001.jpg', '2011-11-03', '2011年，神州八号与天宫一号首次完成对接，中国成为继美俄之后世界上第三个掌握空间交会对接技术的国家'),
(19, 'img/70/2012001.jpg', '2012-09-25', '2012年9月25日，中国第一艘航空母舰“辽宁舰”正式交付海军'),
(20, 'img/70/2013001.jpg', '2013-09-29', '2013年9月29日，中国（上海）自由贸易试验区正式成立'),
(21, 'img/70/2014001.jpg', '2014-03-01', '2014年3月1日，据世界贸易组织统计，我国成为世界第一贸易货物大国'),
(22, 'img/70/2014002.jpeg', '2014-12-04', '2014年12月4日，我国迎来首个国家宪法日'),
(23, 'img/70/2015001.jpg', '2015-09-03', '2015年9月3日，纪念中华人民抗日战争暨世界反法西斯战争胜利70周年大阅兵在北京隆重举行'),
(24, 'img/70/2017001.png', '2017-05-14', '2017年5月，第一届“一带一路”国际合作高峰论坛在北京举行'),
(25, 'img/70/2018001.jpg', '2018-10-23', '2018年10月23日，历时九年的港珠澳大桥正式建成通车');

-- --------------------------------------------------------

--
-- 表的结构 `footprint_sign`
--

CREATE TABLE `footprint_sign` (
  `spid` int(100) NOT NULL COMMENT '足迹内容id',
  `spnum` int(30) NOT NULL COMMENT '足迹编号，和footprint表的psign同步',
  `spsite` char(200) NOT NULL COMMENT '足迹地点',
  `spcountry` char(50) NOT NULL COMMENT '足迹地区',
  `spfpdate` date NOT NULL COMMENT '足迹日期',
  `spimgUrl` varchar(500) NOT NULL COMMENT '足迹的图片地址',
  `sptextarea` varchar(300) NOT NULL COMMENT '足迹寄语',
  `sptagList` char(100) NOT NULL COMMENT '足迹标签'
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `footprint_sign`
--

INSERT INTO `footprint_sign` (`spid`, `spnum`, `spsite`, `spcountry`, `spfpdate`, `spimgUrl`, `sptextarea`, `sptagList`) VALUES
(1, 1, '北京市东城区西长安街天安门-前石狮子', '北京市', '2019-09-24', '[\"img/1569472036936-2452.jpeg\",\"img/1569472044199-73.jpeg\"]', '一片花瓣，随着风\n似蝴蝶般，翩然而来\n落进室内，俯身拾起花瓣，\n想起自己如同迷途的羔羊，\n找寻不到心灵的归宿，却总是被风雨阻挡。\n这花瓣也如同我吗？忘了归途，还是伴着风浪迹天涯', '[\"革命盛地\",\"旅行\"]'),
(2, 1, '北京市丰台区金泰彤翔写字楼-A座', '北京市', '2019-09-25', '[\"img/1569472176489-9377.jpg\",\"img/1569472193849-963.jpg\"]', '真正的君子有傲骨却无傲气，有傲气就会骄人，无傲骨就会媚人。不娇不媚，才是真正的大丈夫。什么是大丈夫?孟子说“富贵不能淫，贫贱不能移，威武不能屈，此之谓大丈夫!”如何能成为大丈夫?孟子说“养浩然之气。”', '[\"古镇\",\"山水\",\"沿途美食\"]'),
(3, 2, '北京市东城区西长安街天安门-前石狮子', '北京市', '2019-09-24', '[\"img/1569472036936-2452.jpeg\",\"img/1569472044199-73.jpeg\"]', '一片花瓣，随着风\n似蝴蝶般，翩然而来\n落进室内，俯身拾起花瓣，\n想起自己如同迷途的羔羊，\n找寻不到心灵的归宿，却总是被风雨阻挡。\n这花瓣也如同我吗？忘了归途，还是伴着风浪迹天涯', '[\"革命盛地\",\"旅行\"]'),
(4, 2, '北京市丰台区金泰彤翔写字楼-A座', '北京市', '2019-09-25', '[\"img/1569472176489-9377.jpg\",\"img/1569472193849-963.jpg\"]', '真正的君子有傲骨却无傲气，有傲气就会骄人，无傲骨就会媚人。不娇不媚，才是真正的大丈夫。什么是大丈夫?孟子说“富贵不能淫，贫贱不能移，威武不能屈，此之谓大丈夫!”如何能成为大丈夫?孟子说“养浩然之气。”', '[\"古镇\",\"山水\",\"沿途美食\"]'),
(5, 1, '北京市东城区西长安街天安门-前石狮子', '北京市', '2019-09-24', '[\"img/1569472036936-2452.jpeg\",\"img/1569472044199-73.jpeg\"]', '一片花瓣，随着风\n似蝴蝶般，翩然而来\n落进室内，俯身拾起花瓣，\n想起自己如同迷途的羔羊，\n找寻不到心灵的归宿，却总是被风雨阻挡。\n这花瓣也如同我吗？忘了归途，还是伴着风浪迹天涯', '[\"革命盛地\",\"旅行\"]'),
(6, 3, '北京市东城区中华路12号中山公园', '北京市', '2019-09-25', '[\"img/1569475227295-9883.jpg\"]', '11212121', '[\"美食\"]'),
(7, 3, '北京市东城区中华路12号中山公园', '北京市', '2019-09-26', '[\"img/1569475252508-7014.jpg\"]', '2222', '[\"旅行\",\"萌宠\",\"科技\"]'),
(8, 3, '北京市东城区中华路12号中山公园', '北京市', '2019-09-25', '[\"img/1569475227295-9883.jpg\"]', '11212121', '[\"美食\"]'),
(9, 4, '北京市东城区中华路12号天安门', '北京市', '2019-09-23', '[\"img/1569565562434-4597.jpg\",\"img/1569565571252-2949.jpg\"]', '白云飘飘，阳光明媚，洒向人间，整个世界和暖而明亮。\n\n　　冬日的南国，不时落下潇潇冷雨，冬风吹过，一阵寒冷迎面扑来。那些行色匆匆的女子，也不禁裹紧外套。冬日不是不好，景色也很美，冰条挂满枝头，全世界耀眼的白。\n\n　　雨，随风潜入夜，润物细无声。而我觉得，春风是有生命的，一滴、两滴，轻轻地落在叶子上，让叶子散发出翠绿的光泽。春雨，轻吻花朵，让花儿更加美艳。春雨用它的指尖在湖面作画，在女子心里作诗。', '[\"旅行\"]'),
(10, 4, '北京市西城区钱市胡同6号前门大栅栏胡同', '北京市', '2019-09-27', '[\"img/1569565716367-3343.jpg\",\"img/1569565733463-5292.jpg\"]', '爱在春色深深处。大胆去爱吧，这是个自由的年代；深情去爱吧，不要辜负了这美好的季节，这美丽动人的风景，不要错过了如此美好的时光。\n\n　　爱在春色深深处。天上人间几回闻？我们的青春应该用热忱洋溢、不忘初心来形容。爱着风、爱着雨、爱着阳光、爱着春花、爱着蓝天，彼此不离不弃，为爱付出，让我们高唱春天的歌曲，手牵手，踏遍天涯，访编春天，歌遍云和月。', '[\"高原风光\",\"美食\",\"取经\"]'),
(11, 4, '北京市东城区中华路12号天安门', '北京市', '2019-09-23', '[\"img/1569565562434-4597.jpg\",\"img/1569565571252-2949.jpg\"]', '白云飘飘，阳光明媚，洒向人间，整个世界和暖而明亮。\n\n　　冬日的南国，不时落下潇潇冷雨，冬风吹过，一阵寒冷迎面扑来。那些行色匆匆的女子，也不禁裹紧外套。冬日不是不好，景色也很美，冰条挂满枝头，全世界耀眼的白。\n\n　　雨，随风潜入夜，润物细无声。而我觉得，春风是有生命的，一滴、两滴，轻轻地落在叶子上，让叶子散发出翠绿的光泽。春雨，轻吻花朵，让花儿更加美艳。春雨用它的指尖在湖面作画，在女子心里作诗。', '[\"旅行\"]'),
(12, 5, '北京市东城区中华路12号中山公园', '北京市', '2019-09-25', '[\"img/1569566104143-6521.jpg\",\"img/1569566111379-4375.jpg\"]', '时光的单车飞快驶去，岁月的倒影也将消失，白天与黑夜不停的交替，轮回的四季斑驳了谁的岁月，蹉跎了谁的年华。一个人静静地与岁月交错，于平淡之中细细体会生活的深意，去注视，去聆听，去感受那些带着希望的别离以及那些经受沧桑的相逢，不论时光如何飞转，那些落花一样的往事，依然鲜活地存在于我的脑海之中。当岁月和美丽的回忆已成为风中的叹息，我们伤感的眼里也许依然残存旧时的泪痕，模糊了视线，不敢轻易触碰。', '[\"旅行\",\"古镇\",\"水乡\"]'),
(13, 5, '北京市东城区中华路12号中山公园', '北京市', '2019-09-26', '[\"img/1569566163287-6837.jpg\",\"img/1569566173665-2287.jpg\"]', '生活的列车慢慢的前进，有些人下去，也有人上去，不慌不忙的过着行云流水的日子，有的人知道自己的前方在哪里停靠，生活充实而安逸，有些人庸庸碌碌的过着不起波澜的日子，每天无头鸟似的瞎忙，朦胧的眼神向世界宣告着昏暗思想，一个个皮囊悬浮在空气中，没有生机的灵魂过着糜烂的时间。没有归属，无处生根。有时我们在迷茫青春的时候，日子也慢慢地溜走，不留一点痕迹。', '[\"萌宠\",\"旅行\"]'),
(14, 5, '北京市丰台区马家堡路27号院-1号楼马家堡路27号院', '北京市', '2019-09-27', '[\"img/1569566209272-264.jpg\"]', '时光不可阻挡，岁月交错中总要有些思量。人生只有在不短的思考中才会有所进步，有所追求，有了目标的人生才不会孤独和无助，只有让自己的心静下来时一些前方的东西才会明朗的展现在我们的面前。让我们不再迷惑于为所谓的挣扎中，谁的年华没有色彩，谁的青春没有耀眼的光芒，只是在岁月的长河里我们的选择不同，所得到的结局就不同，每个人都需要努力才会得到一切自己所要追求的东西和梦想。\n', '[\"水乡\",\"高原风光\",\"古镇\",\"山水\",\"旅行\"]'),
(15, 5, '北京市东城区中华路12号中山公园', '北京市', '2019-09-25', '[\"img/1569566104143-6521.jpg\",\"img/1569566111379-4375.jpg\"]', '时光的单车飞快驶去，岁月的倒影也将消失，白天与黑夜不停的交替，轮回的四季斑驳了谁的岁月，蹉跎了谁的年华。一个人静静地与岁月交错，于平淡之中细细体会生活的深意，去注视，去聆听，去感受那些带着希望的别离以及那些经受沧桑的相逢，不论时光如何飞转，那些落花一样的往事，依然鲜活地存在于我的脑海之中。当岁月和美丽的回忆已成为风中的叹息，我们伤感的眼里也许依然残存旧时的泪痕，模糊了视线，不敢轻易触碰。', '[\"旅行\",\"古镇\",\"水乡\"]'),
(16, 6, '杭州市西湖区杭州植物园', '浙江省', '2019-09-26', '[\"img/1569567150601-5702.jpg\",\"img/1569567156839-5967.jpg\"]', '时光荏苒，蹉跎了谁的年华，匆匆行走的岁月长河中，有些人只顾着追寻他人的脚步，忘记了自己的方向，忘记了自己的目标和理想，有些人几顾思量不敢走出自己的道路，因而迷失了方向。迷失了自己。有些人默默坚守，把青春的岁月包裹在温热的怀里，载着它踏上梦想的征途，不留一丝遗憾。不留一点别人靠近的距离，就像是陈孝正为自己规划的一厘米的差距，人生没有从头来过的权利。亦没有后悔的权利，做过的事情，不管有些怎样的结局都会成为过往，我们纵使一味的活在过去的时光里也不会改变一点点发生的故事，向着远方，努力的看看前方的路才是对我们自己的肯定，只有心存希望，才会有拼搏的勇气，才有希望去走更远的路，因为值得，所以一路前行，', '[\"西湖美景\",\"西湖之行\"]'),
(17, 6, '杭州市西湖区杭州植物园', '浙江省', '2019-09-26', '[\"img/1569567194458-7459.jpg\",\"img/1569567203895-874.jpg\"]', '夜，结束了一天的喧嚣后安静下来，伴随着远处路灯那微弱的光。风，毫无预兆地席卷整片旷野，撩动人的思绪万千。星，遥遥地挂在天空之中，闪烁着它那微微星光，不如阳光般灿烂却如花儿般如痴如醉。', '[\"山水\",\"水乡\",\"美食\",\"旅行\"]'),
(18, 6, '杭州市西湖区杭州植物园', '浙江省', '2019-09-27', '[\"img/1569567253271-2067.jpeg\",\"img/1569567258997-6533.jpg\"]', '欲将沉醉换悲凉，清歌莫断肠。这混乱的尘世，究竟充斥了多少绝望和悲伤。你想去做一个勇敢的男子，为爱，为信仰，轰轰烈烈的奋斗一场。你周身充斥着无人可比的灵气和光芒。你有着与伟人比肩的才气和名声，你是那样高傲孤洁的男子。你的一寸狂心未说，已经几度黄昏雨', '[\"水乡\",\"沿途美食\"]'),
(19, 6, '杭州市西湖区杭州植物园', '浙江省', '2019-09-26', '[\"img/1569567150601-5702.jpg\",\"img/1569567156839-5967.jpg\"]', '时光荏苒，蹉跎了谁的年华，匆匆行走的岁月长河中，有些人只顾着追寻他人的脚步，忘记了自己的方向，忘记了自己的目标和理想，有些人几顾思量不敢走出自己的道路，因而迷失了方向。迷失了自己。有些人默默坚守，把青春的岁月包裹在温热的怀里，载着它踏上梦想的征途，不留一丝遗憾。不留一点别人靠近的距离，就像是陈孝正为自己规划的一厘米的差距，人生没有从头来过的权利。亦没有后悔的权利，做过的事情，不管有些怎样的结局都会成为过往，我们纵使一味的活在过去的时光里也不会改变一点点发生的故事，向着远方，努力的看看前方的路才是对我们自己的肯定，只有心存希望，才会有拼搏的勇气，才有希望去走更远的路，因为值得，所以一路前行，', '[\"西湖美景\",\"西湖之行\"]'),
(20, 7, '西双版纳傣族自治州景洪市嘎兰北路4号金龙山寨小区-46号楼', '云南省', '2019-09-25', '[\"img/1569577331799-9589.jpg\",\"img/1569577337847-3655.jpg\"]', '　晚霞破月的天际，依旧映红了归家的路途，流浪了好久的笔调写满了疲倦的素笺，伴着枯萎的憔悴，与年华斑驳的碎影相逢，溅起涟漪在心田的几缕游丝浅叹，让年华牵住执笔的手，静听潺潺流水；波动在逐流的心海，唤名为；婆娑年华，勾勒了谁的斑驳唯有情醉琉璃一宿，又是一个不眠的夜。', '[\"旅行\",\"革命盛地\",\"山水\"]'),
(21, 7, '西双版纳傣族自治州景洪市嘎兰北路4号金龙山寨小区-46号楼', '云南省', '2019-09-25', '[\"img/1569577244139-7877.jpg\",\"img/1569577272492-8211.jpg\"]', '　一直执着于生命的简约格调，只愿用一颗淡然的心看云卷云舒，看季节更迭。许多不合时节的事物，必然会被光阴遗落，就像曾经繁茂的秋叶，待生命枯竭，终将脱离叶脉的相系相牵。而我，一直在这里，抖落一身的负累，永恒以树的姿态站立于季风中，昂首向着那无边温暖的碧蓝晴空。', '[\"西双版纳\",\"沿途美食\",\"水乡\"]'),
(22, 7, '西双版纳傣族自治州景洪市嘎兰北路4号金龙山寨小区-46号楼', 'Shan', '2019-09-27', '[\"img/1569577381161-9732.jpg\",\"img/1569577390309-3914.jpg\"]', '指尖轻触玻窗，嗤嗤的响声，惊动了脆弱的心脏，一阵阵的酸楚，像浪潮般袭来，若果这样酸酸的痛可以代替撕心裂肺，那就让他长久点，这样时间会把我忘记，这样便可躲在这里，让那些软弱手舞足蹈，让那些脆弱和不堪拼命娱乐，让那颗紧绷的心，少少松弦。\n\n　　曾过往，伊颜纯美无暇，如玉般璀璨，许多人像发现了财富，紧抱于怀，怜香般害怕失去。那时，遇见你的是洗礼过后的悔过者，只懂怜香，而不懂惜玉，再璀璨也掩盖不了他身上久积的灰尘，铸造不了你，也成就不了他，于是乎，迷糊坚固了戏剧化的情谊，疼只是简单的疼。', '[\"高原风光\",\"旅行\",\"沿途美食\"]'),
(23, 8, '西双版纳傣族自治州景洪市嘎兰北路4号金龙山寨小区-46号楼', '云南省', '2019-09-25', '[\"img/1569577244139-7877.jpg\",\"img/1569577272492-8211.jpg\"]', '　一直执着于生命的简约格调，只愿用一颗淡然的心看云卷云舒，看季节更迭。许多不合时节的事物，必然会被光阴遗落，就像曾经繁茂的秋叶，待生命枯竭，终将脱离叶脉的相系相牵。而我，一直在这里，抖落一身的负累，永恒以树的姿态站立于季风中，昂首向着那无边温暖的碧蓝晴空。', '[\"西双版纳\",\"沿途美食\",\"水乡\"]'),
(24, 8, '西双版纳傣族自治州景洪市嘎兰北路4号金龙山寨小区-46号楼', '云南省', '2019-09-25', '[\"img/1569577331799-9589.jpg\",\"img/1569577337847-3655.jpg\"]', '　晚霞破月的天际，依旧映红了归家的路途，流浪了好久的笔调写满了疲倦的素笺，伴着枯萎的憔悴，与年华斑驳的碎影相逢，溅起涟漪在心田的几缕游丝浅叹，让年华牵住执笔的手，静听潺潺流水；波动在逐流的心海，唤名为；婆娑年华，勾勒了谁的斑驳唯有情醉琉璃一宿，又是一个不眠的夜。', '[\"旅行\",\"革命盛地\",\"山水\"]'),
(25, 8, '西双版纳傣族自治州景洪市嘎兰北路4号金龙山寨小区-46号楼', 'Shan', '2019-09-27', '[\"img/1569577381161-9732.jpg\",\"img/1569577390309-3914.jpg\"]', '指尖轻触玻窗，嗤嗤的响声，惊动了脆弱的心脏，一阵阵的酸楚，像浪潮般袭来，若果这样酸酸的痛可以代替撕心裂肺，那就让他长久点，这样时间会把我忘记，这样便可躲在这里，让那些软弱手舞足蹈，让那些脆弱和不堪拼命娱乐，让那颗紧绷的心，少少松弦。\n\n　　曾过往，伊颜纯美无暇，如玉般璀璨，许多人像发现了财富，紧抱于怀，怜香般害怕失去。那时，遇见你的是洗礼过后的悔过者，只懂怜香，而不懂惜玉，再璀璨也掩盖不了他身上久积的灰尘，铸造不了你，也成就不了他，于是乎，迷糊坚固了戏剧化的情谊，疼只是简单的疼。', '[\"高原风光\",\"旅行\",\"沿途美食\"]'),
(26, 10, '北京市东城区中华路4号中山公园-南门', '北京市', '2019-09-26', '[\"img/1569583785416-6841.jpg\",\"img/1569583791005-8801.jpg\"]', '酷热的夏天刚刚过去，秋风吹来，秋牵着一个个节气的手，舞动着长袖，用婀娜多姿的舞姿，用变幻神奇的旋律，动听的音符，把蓝天吹得一会白云飘飘，一会云蒸霞蔚，一会仙女舞袖，一会又涌来千顷碧波。更让那成千上万得雀鸟，不顾辛苦劳顿，路途遥远，赶赴银汉，为牛郎织女架起一座相会的鹊桥，就为这对生离死别的鸳鸯说上一晚悄悄话。', '[\"革命盛地\",\"旅行\",\"萌宠\"]'),
(27, 10, '绍兴市越城区越强混凝土公司', '浙江省', '2019-09-26', '[\"img/1569583847258-7934.jpg\",\"img/1569583853147-6698.jpg\"]', '秋天的风，优雅中体现成熟和高雅。砍高粱、掐谷子、掰玉米、刨芋头、割豆子、下苹果、晒柿子、揪石榴、摘花生、耩麦子，一个个音符，无不让秋风演奏得动听、感人。仰望湛蓝的长空，会让你一扫往日沉闷枯燥的苦闷，心情更加舒畅了，一股热爱蓝天热爱大自然钟爱乡村田野的激情，便油然而生。', '[\"高原风光\"]');

-- --------------------------------------------------------

--
-- 表的结构 `publish_footprint`
--

CREATE TABLE `publish_footprint` (
  `pid` int(11) NOT NULL COMMENT '发表足迹id',
  `ptitle` char(30) NOT NULL COMMENT '足迹名称',
  `praise` int(100) NOT NULL DEFAULT 0 COMMENT '足迹点赞数',
  `psign` int(10) DEFAULT NULL COMMENT '足迹对应的标号，和足迹内容表的snum一致',
  `firstfpimgurl` char(200) NOT NULL COMMENT '第一条足迹图片地址',
  `firstfptagList` char(200) NOT NULL COMMENT '第一条足迹标签内容',
  `unum` char(20) NOT NULL COMMENT '用户账号',
  `uname` char(100) NOT NULL COMMENT '用户名'
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `publish_footprint`
--

INSERT INTO `publish_footprint` (`pid`, `ptitle`, `praise`, `psign`, `firstfpimgurl`, `firstfptagList`, `unum`, `uname`) VALUES
(1, '法海你不懂爱', 0, NULL, '[\"img/1569472036936-2452.jpeg\",\"img/1569472044199-73.jpeg\"]', '[\"革命盛地\",\"旅行\"]', 'sxp', '苏晓鹏'),
(2, '唐僧的爱情', 0, NULL, '[\"img/1569472036936-2452.jpeg\",\"img/1569472044199-73.jpeg\"]', '[\"革命盛地\",\"旅行\"]', 'sxp', '苏晓鹏'),
(3, '我的足迹', 0, NULL, '[\"img/1569475227295-9883.jpg\"]', '[\"美食\"]', 'sxp', '苏晓鹏'),
(4, '取经路上的遗憾', 0, NULL, '[\"img/1569565562434-4597.jpg\",\"img/1569565571252-2949.jpg\"]', '[\"旅行\"]', '13612345678', '重回女儿国的唐僧'),
(5, '我的苏州行', 0, NULL, '[\"img/1569566104143-6521.jpg\",\"img/1569566111379-4375.jpg\"]', '[\"旅行\",\"古镇\",\"水乡\"]', '13612345678', '重回女儿国的唐僧'),
(6, '我和西湖有个约定', 0, NULL, '[\"img/1569567150601-5702.jpg\",\"img/1569567156839-5967.jpg\"]', '[\"西湖美景\",\"西湖之行\"]', '13612345678', '重回女儿国的唐僧'),
(7, '西双版纳的夏日', 0, NULL, '[\"img/1569577381161-9732.jpg\",\"img/1569577390309-3914.jpg\"]', '[\"高原风光\",\"旅行\",\"沿途美食\"]', '13512345678', '离不开白娘子的法海'),
(8, '西双版纳的夏日', 0, NULL, '[\"img/1569577381161-9732.jpg\",\"img/1569577390309-3914.jpg\"]', '[\"高原风光\",\"旅行\",\"沿途美食\"]', '13512345678', '离不开白娘子的法海'),
(9, '西双版纳的夏日', 0, NULL, '[\"img/1569577381161-9732.jpg\",\"img/1569577390309-3914.jpg\"]', '[\"高原风光\",\"旅行\",\"沿途美食\"]', '13512345678', '离不开白娘子的法海'),
(10, '伟伟爱情', 0, NULL, '[\"img/1569583785416-6841.jpg\",\"img/1569583791005-8801.jpg\"]', '[\"革命盛地\",\"旅行\",\"萌宠\"]', '13512345678', '离不开白娘子的法海');

-- --------------------------------------------------------

--
-- 表的结构 `role`
--

CREATE TABLE `role` (
  `rid` int(30) NOT NULL COMMENT '角色id',
  `rname` char(20) NOT NULL COMMENT '角色名称',
  `rnum` int(10) NOT NULL COMMENT '角色编号'
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `role`
--

INSERT INTO `role` (`rid`, `rname`, `rnum`) VALUES
(1, '普通用户', 0),
(2, 'VIP用户', 1),
(3, '管理员', 2),
(4, '高级管理员', 3);

-- --------------------------------------------------------

--
-- 表的结构 `tag`
--

CREATE TABLE `tag` (
  `tid` int(11) NOT NULL COMMENT '图片标签id',
  `ttitle` char(10) NOT NULL COMMENT '图片标签名',
  `tpid` int(10) NOT NULL COMMENT '标签类型id'
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `tag`
--

INSERT INTO `tag` (`tid`, `ttitle`, `tpid`) VALUES
(1, '古镇', 1),
(2, '山水', 1),
(3, '美食', 1),
(4, '革命盛地', 1),
(5, '旅行', 1),
(6, '萌宠', 1),
(7, '科技', 1),
(8, '高原风光', 1),
(9, '水乡', 1),
(10, '沿途美食', 1),
(11, '雪花', 1);

-- --------------------------------------------------------

--
-- 表的结构 `user`
--

CREATE TABLE `user` (
  `uid` int(10) NOT NULL COMMENT '用户id',
  `unum` char(30) NOT NULL COMMENT '用户账号，用于登陆账号',
  `uname` char(30) NOT NULL COMMENT '用户名，用于网页显示',
  `upwd` char(50) NOT NULL COMMENT '用户密码',
  `ugender` int(2) DEFAULT NULL COMMENT '用户性别',
  `uphone` char(11) DEFAULT NULL COMMENT '用户电话号码',
  `uEmail` char(30) DEFAULT NULL COMMENT '用户Email',
  `urole` int(3) DEFAULT 0 COMMENT '用户角色',
  `rnum` int(3) NOT NULL COMMENT '角色编号',
  `uscore` int(50) DEFAULT 0 COMMENT '用户积分',
  `upic` char(255) DEFAULT NULL COMMENT '用户头像地址',
  `utext` varchar(500) DEFAULT NULL COMMENT '用户备注信息'
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `user`
--

INSERT INTO `user` (`uid`, `unum`, `uname`, `upwd`, `ugender`, `uphone`, `uEmail`, `urole`, `rnum`, `uscore`, `upic`, `utext`) VALUES
(1, 'zxm', '朱雪梅', 'cc4b5438803d71cfb5360653a1f70352', 0, '123123123', '1238612', 2, 2, 1, '1231231212', '123456789765432345'),
(2, 'sfq', '孙复棋', '935e5508d5a6b59b819a7f0dada27eb6', 1, '11', '11', 2, 2, 11, '', '11'),
(3, 'lww', '陆伟伟', 'f15f46e1607e89304b9f9115492bd947', 1, '13312345678', 'lww111@163.com', 2, 2, 112, '', '修改信息'),
(4, 'sxp', '苏晓鹏', '2153a452ad28d2466892ec78fc09dbf5', 1, '13607002103', '1233@qq.com', 2, 2, 0, 'img/1569471547461-2903.jpg', 'woshidalao'),
(5, 'admin', '高级管理员', '0192023a7bbd73250516f069df18b500', NULL, '13567825627', '1369866743@163.com', 3, 3, 120, NULL, NULL),
(6, 'ss', 'peng', '2153a452ad28d2466892ec78fc09dbf5', 0, '111111', '111', 1, 1, 0, '', '额外翁认为'),
(14, '13607002109', 'nbb', '409df02d783dcacade3058e229f13f95', 0, '', '', 1, 1, 0, '', ''),
(16, '13512345678', '离不开白娘子的法海', '2153a452ad28d2466892ec78fc09dbf5', NULL, NULL, NULL, 0, 0, 0, NULL, NULL),
(17, '13612345678', '重回女儿国的唐僧', '2153a452ad28d2466892ec78fc09dbf5', NULL, NULL, NULL, 1, 1, 0, NULL, NULL);

--
-- 转储表的索引
--

--
-- 表的索引 `city`
--
ALTER TABLE `city`
  ADD PRIMARY KEY (`cid`);

--
-- 表的索引 `footprint_70`
--
ALTER TABLE `footprint_70`
  ADD PRIMARY KEY (`chid`);

--
-- 表的索引 `footprint_sign`
--
ALTER TABLE `footprint_sign`
  ADD PRIMARY KEY (`spid`);

--
-- 表的索引 `publish_footprint`
--
ALTER TABLE `publish_footprint`
  ADD PRIMARY KEY (`pid`),
  ADD UNIQUE KEY `pid` (`pid`),
  ADD UNIQUE KEY `psign` (`psign`);

--
-- 表的索引 `role`
--
ALTER TABLE `role`
  ADD PRIMARY KEY (`rid`);

--
-- 表的索引 `tag`
--
ALTER TABLE `tag`
  ADD PRIMARY KEY (`tid`);

--
-- 表的索引 `user`
--
ALTER TABLE `user`
  ADD PRIMARY KEY (`uid`),
  ADD UNIQUE KEY `unum` (`unum`),
  ADD KEY `rnum` (`rnum`);

--
-- 在导出的表使用AUTO_INCREMENT
--

--
-- 使用表AUTO_INCREMENT `footprint_70`
--
ALTER TABLE `footprint_70`
  MODIFY `chid` int(30) NOT NULL AUTO_INCREMENT COMMENT '70周年足迹id', AUTO_INCREMENT=26;

--
-- 使用表AUTO_INCREMENT `footprint_sign`
--
ALTER TABLE `footprint_sign`
  MODIFY `spid` int(100) NOT NULL AUTO_INCREMENT COMMENT '足迹内容id', AUTO_INCREMENT=28;

--
-- 使用表AUTO_INCREMENT `publish_footprint`
--
ALTER TABLE `publish_footprint`
  MODIFY `pid` int(11) NOT NULL AUTO_INCREMENT COMMENT '发表足迹id', AUTO_INCREMENT=11;

--
-- 使用表AUTO_INCREMENT `role`
--
ALTER TABLE `role`
  MODIFY `rid` int(30) NOT NULL AUTO_INCREMENT COMMENT '角色id', AUTO_INCREMENT=5;

--
-- 使用表AUTO_INCREMENT `tag`
--
ALTER TABLE `tag`
  MODIFY `tid` int(11) NOT NULL AUTO_INCREMENT COMMENT '图片标签id', AUTO_INCREMENT=12;

--
-- 使用表AUTO_INCREMENT `user`
--
ALTER TABLE `user`
  MODIFY `uid` int(10) NOT NULL AUTO_INCREMENT COMMENT '用户id', AUTO_INCREMENT=18;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
